#### Ivan's Awesome Brewfile
#### OS: Mac OSX
#### Machine: MBP - 13in (2014)
#### Date: 2017-11-01

## Command-line formulas
tap 'caskroom/cask' #Deprecated - Homebrew includes Cask by default
tap 'homebrew/bundle'
tap 'homebrew/core'
brew 'cask'
# Zsh formulas
brew 'zsh'
brew 'zsh-completions'
brew 'zsh-syntax-highlighting'

# Update coreutils - the ones in mac are outdated
brew 'coreutils'
brew 'moreutils'
brew 'findutils'
brew 'gnu-sed' --with-default-names

# More formulas
brew 'python3'
brew 'cmake'
brew 'gdal'
brew 'ghostscript'
brew 'htop'
brew 'imagemagick'
brew 'node'
brew 'postgresql'
brew 'screen'
brew 'tesseract'
brew 'tmux'
brew 'tree'
brew 'vim' --with-override-system-vi --with-python3
brew 'wget'

# Install Cask
# specify a directory to install
cask_args appdir: '/Applications'
tap 'caskroom/homebrew-cask' || true

#Internet 
cask 'google-chrome'
cask 'firefox'
cask 'torbrowser'

#Utilities and work
cask 'skype'
cask 'slack'
cask 'dropbox'
cask 'whatsapp'
cask 'licecap'
cask 'adobe-acrobat-reader'
cask 'mactex'
cask 'lastpass'

#Development
cask 'iterm2'
cask 'rstudio'
cask 'sublime-text'
cask 'unrarx'
cask 'intel-power-gadget'
cask 'dbeaver-community'
cask 'smcfancontrol'
cask 'atom'
cask 'docker'

#Entreteinment
cask 'spotify'
cask 'spotify-notifications'

